<h1 class="page-title d-none">{Ошибка} 404</h1>
<div>
<h4>{Возможные причины}:</h4>
<ol> 
    <li>{Страница доступна только для авторизованных пользователей}.
    <li>{Ссылка набрана неправильно}.
    <li>{Ссылка, из поисковой машины или с сайта, устарела}.
    <li>{Страница удалена или перемещена администратором}.
</ol>
<h4>{Что делать}:</h4>
<ol>
    <li>{Пройти} <a href="/users/">{авторизацию}</a>
	<li>{Проверьте, правильно ли набран адрес}.
	<li>{Воспользуйтесь} <a href="/search/" class="link">{поиском по сайту}</a>.
	<li>{Обратитесь к администратору}.
</ol>
</div>