<?php

function tab_showcase() {
    global $PHPShopGUI;
    return $PHPShopGUI->setInfo('
     <p>Дополнительная витрина позволяет выводить заданные категории товаров на дополнительных адресах с персональными настройками отображения дизайна, страниц и текстовых блоков без повторной установки платформы и без покупки новой лицензию по полной стоимости (стоимость лицензии для дополнительной витрины значительно меньше). Все остальные настройки магазина являются общие и привязаны к единой базе данных. Все заказы и пользователи поступают в единую панель управления. Лицензия приобретается на максимальное количество дополнительных витрин, адреса витрин управляются в карточке редактирования витрины и могут меняться по вашему усмотрению в любое время. 
     </p>
     <h4>Этапы создания витрины</h4>
     <ol>
     <li>Приобрести <a href="http://www.phpshop.ru/order/#showcase" target="_blank" class="btn btn-xs btn-default "><span class="glyphicon glyphicon-shopping-cart"></span> отдельную лицензию</a> на дополнительную витрину или лицензию на безлимитное количество витрин.
     <li>Создать новый <kbd>Алиас</kbd> (синоним адреса сайта) с адресом витрины через панель управления хостингом.
     <li>Прописать <kbd>DNS сервера</kbd> для алиаса по аналогии с основном доменом через панель управления доменом или хостингом. Узнать свои DNS сервера можно через <a href="http://whois.ru/'.$_SERVER['SERVER_NAME'].'" target="_blank"><span class="glyphicon glyphicon-share-alt"></span> Whois.ru</a>
     <li>Дождаться смены DNS серверов (обычно требуется 3-6 часов) алиаса и убедиться, что при переходе на адрес алиаса открывается основной сайт <mark>'.$_SERVER['SERVER_NAME'].'</mark> с информацией об ошибке проверки лицензии.
     <li>Добавить новую витрину с точным новым адресом алиаса в поле "Адрес".
     <li>Выбрать по желанию персональный дизайн витрины.
     <li>Выбрать категории товаров для показа на витрине в закладке <kbd>Права</kbd>.
     </ol>
     <p>При изменении параметров лицензии (продление техподдержки и т.д.) или доступа к базе данных, требуется обновление защищенной подписи витрины через кнопку <span class="btn btn-xs btn-default "><span class="glyphicon glyphicon-ok"></span> Сохранить и закрыть</span> в карточке редактирования витрины.</p>
');
}

?>