<p><img src="phpshop/modules/paypal/templates/logo.png" align="left" hspace="10"></p><br><p>PayPal – платежная система, которая позволяет быстрее и безопаснее оплачивать покупки, получать и отправлять средства через Интернет. Более 110 миллионов пользователей по всему миру доверяют нам и пользуются нашими услугами в тысячах интернет-магазинов. Наша система работает с картами Visa, MasterCard и American Express, а с недавнего времени и с Maestro. 
</p><p>
Независимо от того, оплачиваете ли вы покупки или продаете товары и услуги в Интернете с помощью PayPal, вы получаете ряд преимуществ, включая безопасность и удобство использования. К тому же, вы можете быстро и легко совершать денежные переводы по всему миру. </p><p>
<p>@payment_forma@</p>
