<?php

function tab_info($data) {
    global $PHPShopGUI,$VkSeller;
    
    $Info = '<p>
      <h4>Настройки параметров работы по модели YML</h4>
        <h5>Настройка ВКонтакте</h5>
        <ol>
        <li>В меню <kbd>Товары</kbd> &rarr; <kbd>Добавить товар</kbd> в поле <b>Импортировать из файла</b> указать адрес YML-файла: <code>'.$VkSeller->ssl . $_SERVER['SERVER_NAME'] .$GLOBALS['SysValue']['dir']['dir']. '/yml/?marketplace=vk</code> и дождаться загрузки товаров. Для обновления данных следует выполнить повторно загрузку YML-файла. Обновление данных происходит по ключу обновления из настроек модуля.
        </ol>
        <h5>Настройка модуля</h5>
        <ol>
        <li>В модуле выбрать Модель работы <kbd>Oбновление данных через YML</kbd>. Нажать кнопку <b>Сохранить</b></li>
       <li>Поле пароль YML-файла <b>защищает</b> от несанкционированной кражи контента. При использовании пароля ссылка на файл YML примет вид <code>'.$VkSeller->ssl . $_SERVER['SERVER_NAME'] . '/yml/?marketplace=vk&pas=код_защиты</code>. При использовании пароля требуется так же заменить ссылку в ВКонтакте.
     </li> 
        <li>Колонка цен служит для вывода дополнительных цен из карточки товара.</li>
        <li>Ключ обновления задает правило привязки поля артикула <kbd>SKU</kbd> для обновления данных.</li>
        <li>В поле размещение можно выбрать категории для отображения товаров из них в ВКонтакте. Так же настройка включения товара в ВКонтакте доступна в карточке редактирования товара в закладке <kbd>Модули</kbd> &rarr; <b>VK Товары</b>.</li>
      </ol>
      
      <h4>Настройки параметров работы по модели API</h4>
        <h5>Настройка приложения</h5>
         <ol>
         <li><a href="https://id.vk.ru/about/business/go" target="_blank">Создать приложение</a> с любым именем</li>
         <li>В поле <b>Платформа</b> выбрать "Сайт".</li>
         <li>В поле <b>Сообщество</b> выбрать свое сообщество ВКонтакте, если его нет, то следует его создать.</li>
         <li>В поле <b>Базовый домен</b> указать имя своего сайта <code>' . $_SERVER['SERVER_NAME'].$GLOBALS['SysValue']['dir']['dir'].'</code></li>
         <li>В поле <b>Доверенный redirect URI</b> указать ссылку <code>'.$VkSeller->ssl . $_SERVER['SERVER_NAME'].$GLOBALS['SysValue']['dir']['dir'].'/phpshop/modules/vkseller/token.php</code></li>
      </ol>  
        <h5>Настройка модуля</h5>      
         <ol>
         <li>В поле <b>ID сообщества</b> указать числовой идентификатор своего сообщества.</li>
         <li>После создания приложения перейти в меню редактирования приложения <kbd>Настройки</kbd> и скопировать поля <b>ID приложения</b> и <b>Защищённый ключ</b> в одноименные поля в настройках модуля.</li>
        
         <li>Для получения <b>API Ключа</b> все поля должны быть заполнены и сохранены в настройках модуля. Перейдите по ссылке <kbd>Получить Персональный ключ</kbd>, полученные данные сохраните в поля <kbd>API key</kbd>,<kbd>Токен обновления</kbd> и <kbd>ID устройства</kbd>.</li>
      </ol>  
      <h5>Настройка дизайна</h5>      
         <ol>
         <li>Для отображения в подробной карточке товара ссылки на товар в ВКонтакте используется переменная <code>@vkseller_link@</code></li>
      </ol>  
   <h5>Выгрузка товаров в ВКонтакте</h5>
   <ol>
    <li>В карточке редактирования категории в магазине сопоставить выбранную свою категорию с категорией ВКонтакте в закладке <kbd>ВКонтакте</kbd>, поле <kbd>Размещение в ВКонтакте</kbd>.</li>
    <li>В карточке редактирования товара в магазине через закладку "Модули - ВКонтакте" включить опцию <kbd>Включить экспорт в VK</kbd> и сохранить данные. </li>
    <li>Для пакетной выгрузки большого количества товара используйтся кнопка <kbd>Экспортировать данные</kbd> в настройках модуля.</li>
    <li>Список ошибок выгрузки товаров в ВКонтакте доступен в разделе <kbd>Модули</kbd> &rarr; <b>VK Товары</b> &rarr; <b>Журнал ошибок</b>.</li>
    <li>Для выгрузки цен и остатков товаров в ВКонтакт следует добавить новую задачу в модуль <a href="https://docs.phpshop.ru/moduli/razrabotchikam/cron" target="_blank">Задачи</a> с адресом запускаемого файла <code>phpshop/modules/vkseller/cron/products.php</code>. Остатки и цены выгружаются так же при редактировании карточки товара в магазине.</li>
  </ol>
  
  <h5>Загрузка заказов с ВКонтакте</h5>
   <ol>
    <li>В настройках модуля выбрать статус заказов и доставку, поступающих с ВКонтакте.</li>
    <li>В настройках модуля выбрать статус заказов в ВКонтакте для автоматической загрузки в магазин.</li>
    <li>Список заказов для загрузки из ВКонтакте доступен в разделе "Модули - VK Товары - Заказы из VK". По клику на номер заказа откроется карточка с описанием данных по заказу с ВКонтакте. Для загрузки заказа используется кнопка <kbd>Загрузить заказ</kbd>. Загруженный заказ будет иметь статус, выбранный в настройках модуля. В поле "Примечания администратора" загруженного заказа будет информация о загрузке с ВКонтакте и его номер. Для повторной загрузки заказа следует удалить его из базы заказов в магазине. В закладке "Дополнительно" предпросмотра заказа с ВКонтакте выводится полная информация по заказу в виде массива данных.</li>
    <li>Учет товаров в заказе происходит по полям <kbd>VK ID</kbd> (товар выгружен по API) или <kbd>ID</kbd>, <kbd>Акртикул</kbd> (товар выгружен через YML-файл).</li>
        <li>Для автоматической загрузки заказов следует добавить новую задачу в модуль <a href="https://docs.phpshop.ru/moduli/razrabotchikam/cron" target="_blank">Задачи</a> с адресом запускаемого файла <code>phpshop/modules/vkseller/cron/orders.php</code>. Загрузка будет только тех заказов, статус которых был выбран в настройках модуля. </li>
    <li>Поддерживается автоматическое списание товара по признаку статуса заказа в магазине из настроек модуля.</li>
  </ol>
  
 <h5>Загрузка товаров с ВКонтакте</h5>
   <ol>
    <li>Список товаров для загрузки из ВКонтакте доступен в разделе "Модули - VK Товары - Товары из WB". По клику на название товара откроется карточка с описанием данных по товару с ВКонтакте. Для загрузки товара используется кнопка <kbd>Загрузить товар</kbd>. Для повторной загрузки товара следует удалить его из базы товаров в магазине.</li>
  </ol>
        </p>';
    
    return $PHPShopGUI->setInfo($Info, 280, '98%');
}
?>
