
    <P> <strong> ЛІЦЕНЗІЙНА УГОДА НА ПРОГРАМНЕ продукту "PHPShop" </strong> </p>

    <P> Ця Ліцензійна Угода укладається між користувачем програмного продукту "PHPShop" (далі Користувач) та ВП Туренко Д. Л. (далі Автор). Перед використанням продукту уважно ознайомтеся з умовами даної угоди. Якщо ви не згодні з умовами даної угоди, ви не можете використовувати даний продукт. Установка і використання продукту (в тому числі перегляд вихідного коду) означає ваше повну згоду з усіма пунктами цієї угоди. Угода стосується всіх комерційно поширюваним версіям і модифікаціям програмного продукту PHPShop. </P>
    <P> Основні терміни цієї угоди: ЕКЗЕМПЛЯР ПРОГРАМИ - копія продукту "PHPShop", що включає в себе код програми Інтернет-магазину, відтворений в файлах, включаючи електронну або роздруковану документацію. </P>
    <P> Ліцензійна угода вступає в силу з моменту придбання або установки продукту і діє протягом усього терміну використання продукту. </P>
    <P> <b> 1. Предмет ліцензійної угоди </b>
        <br> 1.1. Предметом цього ліцензійної угоди є право використання одного примірника програмного продукту (в подальшому "ЕКЗЕМПЛЯР ПРОГРАМИ", "програма" або "продукт") "PHPShop", що надається Користувачу Автором, в порядку та на умовах, встановлених цією угодою.
        <br> 1.2. Всі положення цієї угоди поширюються як на весь продукт в цілому, так і на його окремі компоненти.
        <br> 1.3. Дана Угода дає право Користувачу на використання однієї копії Продукту на одному web-сервері в межах одного домену.
        <br> 1.4. Ліцензійна угода не надає право власності на продукт "PHPShop" і його компоненти, а тільки право використання ЕКЗЕМПЛЯРА ПРОГРАМИ і його компонентів відповідно до умов, які позначені в пункті 3 цієї угоди.
    <P> <b> 2. Авторські права </b>
        <br> 2.1. Всі авторські права на Продукт, включаючи документацію і вихідний текст, належать Автору, на підставі свідоцтв про державну реєстрацію програми для ЕОМ "PHPShop" №2006614274.
        <br> 2.2. Продукт в цілому або окремо є об'єктом авторського права і захищений Законом РФ "Про правову охорону програм для електронних обчислювальних машин і баз даних" від 23 вересня 1992 року, Законом РФ "Про авторське право і суміжні права" від 9 липня 1993 року, а також міжнародними Договорами.
        <br> 2.3. У разі порушення авторських прав передбачається відповідальність відповідно до чинного законодавства РФ.
    <P> <b> 3. Умови використання продукту і обмеження </b>
        <BR> 3.1. Користувач має право безкоштовно скористатися демо-версією Продукту, скачавши з сайту Ліцензіара www.phpshop.ru і встановивши на сервер протягом 30 днів, і без обмежень часу при установці на локальному комп'ютері. Демо-версії всіх версій Продукту PHPShop працюють без будь-яких обмежень функціональності, крім кількості вивантаження товарів в обробнику 1С версії PHPShop Pro 1C.
        <br> 3.2. Для кожної нової установки Продукту на іншу адресу web-сервера повинна бути придбана окрема Ліцензія. Переклад ліцензії на новий домен можливий тільки при активній технічної підтримки.
        <br> 3.3. Автор залишає за собою право вимагати розміщення зворотнього посилання, із зазначенням Авторського права на сайті, де використовується Продукт. Використання Продукту з порушенням умов цієї Угоди, є порушенням законів про авторське право, і буде переслідуватися відповідно до чинного законодавства. Відмова від розміщення зворотнього посилання із зазначенням Авторського права є порушенням Угоди і обмежує Продукт в наданні технічної підтримки Автором на всі сайти Користувача.
        <br> 3.4. Вид посилання і розміщення строго задається Автором, код посилання не піддається зміні. З метою збереження візуалізації з персональним дизайном можлива зміна кольору посилання (задається ліцензією).
        <br> 3.5. Для офіційних партнерів, після письмового узгодження з Автором, посилання розміщується в зручному для них місці, на кожній сторінці сайту. Ліцензія без копірайтів Автора збільшує вартість Продукту.

<br> 3.6. Підтримується розміщення в некореневі директорії, тобто виду seamply.ru/market1/. Розміщення типу market1.seamply.ru і т.д. вимагає покупки окремої Ліцензії. Технічна підтримка поширюється тільки на одну копію Продукту. Для кожного нового екземпляра магазину, а також для магазинів некореневих директорій виду seamply.ru/market1/, потрібно покупка нової технічної підтримки за тарифами, зазначеними на сайті Ліцензіара. Допускається можливість створення і використання Користувачем додаткової копії Продукту виключно в цілях тестування або внесення змін до початкового коду, за умови, що така копія не буде доступна третім особам.

        <br> 3.7. Після покупки товару покупцеві надаються вихідні коди php-додатки за винятком файлу index.php, в якому відбувається перевірка ліцензії та захист від несанкціонованого поширення програми. Всі додаткові додатки з комплекту EasyControl надаються в скомпільованому вигляді без можливості внесення зміни в код.

        <br> 3.8. Користувач може змінювати, додавати або видаляти відкриті файли придбаного ЕКЗЕМПЛЯРА ПРОГРАМИ "PHPShop" відповідно до законодавства РФ про авторське право. Зміна скомпільованих файлів заборонено і тягне порушення цієї Угоди відповідно до 273 статті КК РФ.

    <P> <b> 4. Відповідальність сторін </b>
        <br> 4.1. Користувач не може копіювати, передавати третім особам або поширювати, здавати в оренду / прокатПродукт і його компоненти, в тому числі, створені на базі Продукту сайти, в будь-якій формі, в тому числі, у вигляді вихідного тексту, будь-яким іншим способом.

        <br> 4.2. Будь-яке розповсюдження Продукту без попередньої згоди Автора, включаючи некомерційне, є порушенням цієї Угоди, і тягне за собою відповідальність згідно з чинним законодавством.

        <br> 4.3. Продукт поставляється на умовах "ЯК Є" ( "AS IS") без надання гарантій продуктивності, купівельної спроможності, збереження даних, а також інших явно виражених або неявних гарантій.

            <br> 4.4. Автор не несе будь-якої відповідальності за заподіяння або можливість заподіяння шкоди Вам, Вашій інформації або Вашому бізнесу внаслідок використання або неможливості використання Продукту.

        <br> 4.5. Автор не несе відповідальність, пов'язану із залученням Вас до адміністративної або кримінальної відповідальності за використання Продукту в протизаконних цілях (включаючи, але не обмежуючись, продажем через Інтернет магазин об'єктів, вилучених з обороту або здобутих злочинним шляхом, призначених для розпалювання міжрасової або міжнаціональної ворожнечі; і т.д.).
        <br> 4.6. Автор не несе відповідальності за працездатність Продукту, в разі внесення Вами яких би то не було змін в код програми.
        <br> 4.7. Забороняється будь-яке використання Продукту, що суперечить чинному законодавству РФ.
        <br> 4.8. За порушення умов цієї угоди настає відповідальність, передбачена законодавством РФ.
    <P> <b> 5. Умови технічної підтримки </b>

<br> 5.1. Купуючи Інтернет-магазину PHPShop Enterprise або PHPShop Pro 1C, Користувач отримує безкоштовну базову технічну підтримку протягом 6 місяців. Для версій PHPShop Basic термін підтримки становить 3 місяці.

        <br> 5.2. Технічна підтримка передбачає доступ до оновлень, технічні консультації, усунення помилок в програмному продукті "PHPShop", виявлених протягом гарантійного періоду.

        <br> 5.3. На підтримку включені консультації з приводу управління і заповнення магазину. Налаштування зв'язку з 1С (підключення до сервера і синхронізація даних). Питання з приводу установки продукту на сервер, рішення проблем, що заважають установки продукту на сервер. Установка і настройка додаткових безкоштовних утиліт з пакета EasyControl.

        <br> 5.4. Консультації проводяться в спеціальному розділі сайту служби технічної підтримки <a target="_blank" href="https://help.phpshop.ru/"> help.phpshop.ru </a> протягом гарантійного терміну у робочі дні (за винятком вихідних і неробочих святкових днів Російської Федерації) з 10 до 18 годин за московським часом.

        <br> 5.5. По закінченню терміну безкоштовної технічної підтримки, Користувач може придбати продовження. Термін дії технічної підтримки продовжується на один рік з моменту оплати продовження. Користувач також отримує можливість завантажити і встановити всі зміни та оновлення, які були випущені до програмного продукту до моменту оплати продовження технічної підтримки. Чинний прайс-лист для отримання технічної підтримки вказано на інтернет-сайті <a target="_blank" href="http://www.phpshop.ru/docs/techpod.html"> phpshop.ru/docs/techpod.html </a>.
        <br> 5.6. Проблеми, що не відносяться до базової технічної підтримки, не можуть бути безкоштовно вирішені. Для виявлення і вирішення таких проблем слід оплатити додаткові технічні роботи. Повний список платних технічних робіт доступний за посиланням: <a target="_blank" href="https://help.phpshop.ru/knowledgebase/article/116"> help.phpshop.ru/knowledgebase/article/116</a>
        <br> 5.7. Персональні доопрацювання і модулі, виконані на замовлення, підтримуються безкоштовно протягом 1 місяця. </a>.

    <P> <b> 6. Політика повернення коштів </b>
        <br> 6.1. У зв'язку з тим, що перед придбанням, Автором надано право перевірити відповідність Продукту потребам Користувача, а саме, встановити демо-версію Продукту, згідно п. 3.1. цієї Угоди, а також, у зв'язку з тим, що Автор при продажу передає нематеріальний продукт, який не підлягає поверненню фізично, повернення грошових коштів Користувачу можливий, якщо Продукт явно не відповідає функціям, які описані в Керівництві Користувача за адресою: <a target = "_ blank "href =" http://faq.phpshop.ru "> faq.phpshop.ru </a>
        <br> 6.2. Будь-які інші споживчі властивості, передбачувані, але не виявлені користувачем при покупці, крім описаних в <a target="_blank" href="http://faq.phpshop.ru"> faq.phpshop.ru </a> і на сайті автора, не можуть бути причиною для повернення грошових коштів.
        <br> 6.3. Повернення грошових коштів здійснюється без комісій банків та інших платежів, за письмовою заявою Користувача, не пізніше 30 (тридцяти) календарних днів з моменту придбання Продукту. У заяві необхідно вказати, що Користувач гарантує невикористання Продукту, а також видалення всіх без винятку отриманих від Автора файлів, що мають відношення до Продукту.
        <br> 6.4. По закінчення 30 (тридцяти) днів з моменту придбання Продукту, претензії Автором не приймаються і грошові кошти не повертаються.
        <br> 6.5. Повернення здійснюється протягом 15 (п'ятнадцяти) календарних днів з моменту отримання письмової заяви в разі прийняття Автором рішення про повернення грошових коштів Користувачу.
        <br> 6.6. Безкоштовні утиліти EasyControl, крім платної синхронізації з 1С, надаються на умовах роботи ЯК Є "(" AS IS "), і не можуть бути причиною повернення грошових коштів за Продукт.

    <P> <b> 7. Зміна і розірвання угоди </b>
        <br> 7.1. У разі невиконання користувачем одного з вищевказаних положень, Автор має право в односторонньому порядку розірвати цю угоду, повідомивши про це користувача.
        <br> 7.2. При розірванні угоди Користувач зобов'язаний припинити використання продукту і видалити Ліцензія повністю.
        <br> 7.3. Користувач має право розірвати цю угоду в будь-який час, повністю видаливши ЕКЗЕМПЛЯР ПРОГРАМИ "PHPShop", при цьому, розірвання Угоди не зобов'язує Автора повертати кошти, витрачені Користувачем на придбання Продукту.
        <br> 7.4. У разі якщо компетентний суд визнає будь-які положення цієї угоди недійсними, Угода продовжує діяти в іншій частині.
        <br> 7.5. Ця ліцензійна угода також поширюється на всі оновлення, які пропонуються користувачеві в рамках технічної підтримки, якщо тільки при оновленні програмного продукту користувачеві не пропонується ознайомитися і прийняти нове ліцензійну угоду або доповнення до чинної угоди.
    </P>

    <P>
        <Strong> Контактна інформація </strong> <br>
        
        Адреса сайту: <a href="http://www.phpshop.ru" target="_blank"> www.phpshop.ru </a> <br>
        Підручник: <a href="http://faq.phpshop.ru" target="_blank"> faq.phpshop.ru </a> <br>
        Телефон: +7 (495) 989-11-15 <br>
        Технічна підтримка: <a href="https://help.phpshop.ru" target="_blank"> help.phpshop.ru </a> <br> <br>
        <Input type = "checkbox" checked disabled> Я приймаю умови ліцензійної угоди.
    </P>