// Locale
var locale = {
    charset: "windows-1251",
    commentList: {
        mesHtml: "функція додавання коментаря можлива тільки для авторизованих користувачів.\n<a href='/users/?from=true'>Авторизуйтесь або пройдіть реєстрацію</a>.",
        mesSimple: "функція додавання коментаря можлива тільки для авторизованих користувачів.\пАвторизуйтесь або пройдіть реєстрацію.",
        mes: "ваш коментар буде доступний іншим користувачам тільки після проходження модерації..."
    },
    OrderChekJq: {
        badReqEmail: "будь ласка, вкажіть коректний E-mail",
        Badreqname: "зверніть увагу, \ пимя повинно складатися не менше ніж з 3 букв",
        Badreq: "зверніть увагу,\песть поля, обов'язкові для заповнення",
        badDelivery: "будь ласка, \ пвиберіть доставку"
    },
    commentAuthErrMess: "Додати коментар може тільки авторизований користувач.\n<a href='" + ROOT_PATH + "/users/?from=true ' > будь ласка, авторизуйтесь або пройдіть реєстрацію</a>.",
    incart: "у кошику",
    cookie_message: "з метою надання найбільш оперативного обслуговування на даному сайті використовуються cookie-файли. Використовуючи даний сайт, Ви даєте свою згоду на використання нами cookie-файлів.",
    show: "показати",
    hide: "приховати",

};

$().ready(function () {
    locale_def = locale;
});