<?php

function tab_info($data) {
    global $PHPShopGUI;
    
    $Info = '<p>
      <h4>Настройка модуля</h4>
    <ol>
        <li>Зарегистрироваться в <a href="https://seller.wildberries.ru" target="_blank">WB Partners</a>.</li>
        <li>В личном кабинете WB Seller открыть <a href="https://seller.wildberries.ru/supplier-settings/access-to-api" target="_blank">Настройки - Доступ к  API</a>, создать новый токен (тип токена <kbd>Стандартный</kbd>, имя токена любое). Необходимо скопировать значение токена в поле <kbd>API key</kbd> в настройках модуля.
        </li>
        <li>В настройках модуля выбрать статус заказов, поступающих с WB.</li>
        <li>В настройках модуля выбрать склад WB. Если склад не создан, то его нужно предварительно создать в <a href="https://seller.wildberries.ru/marketplace-pass/warehouses" target="_blank">Мои склады и пропуска</a>.</li>
        <li>Для отображения в подробной карточке товара ссылки на товар в Wildberries используется переменная <code>@wbseller_link@</code></li>
    </ol>

   <h4>Выгрузка товаров в WB</h4>
   WB принимает данные по товарам с четко указанными данными по категориям и характеристикам из базы WB.
   <ol>
    <li>В карточке редактирования категории в магазине сопоставить выбранную свою категорию с категорией WB в закладке <kbd>WB</kbd>, поле <kbd>Размещение в WB</kbd>. При наборе имени категории будет показано всплывающее окно категорий WB, доступных по поиску вводимых данных. Сохранить выбор и перегрузить страницу, после чего появится блок "Сопоставление характеристик с WB".</li>
    <li>Сопоставить или создать необходимые характеристики с указанными значениями.</li>
    <li>В карточке редактирования товара в магазине через закладку "Модули - WB" включить опцию <kbd>Включить экспорт в WB</kbd> и сохранить данные. Список товаров для выгрузки в WB доступен в разделе "Модули - WB Partners - Товары для WB".</li>
    <li>После успешной выгрузки товары появятся в разделе <a href="https://seller.wildberries.ru/new-goods" target="_blank">Товары - Карточки товаров - Созданные</a> в WB.</li>
    <li>Для автоматической выгрузки цен и остатков товаров в WB по расписанию следует добавить новую задачу в модуль <a href="https://docs.phpshop.ru/moduli/razrabotchikam/cron" target="_blank">Задачи</a> с адресом запускаемого файла <code>phpshop/modules/wbseller/cron/products.php</code>. Остатки и цены выгружаются так же при редактировании карточки товара в магазине.</li>
  </ol>
  
  <h4>Загрузка заказов с WB</h4>
   <ol>
    <li>Список заказов для загрузки из WB доступен в разделе "Модули - WB Partners - Заказы из WB". По клику на номер заказа откроется карточка с описанием данных по заказу с WB. Для загрузки заказа используется кнопка <kbd>Загрузить заказ</kbd>. Загруженный заказ будет иметь статус, выбранный в настройках модуля. В поле "Примечания администратора" загруженного заказа будет информация о загрузке с WB и его номер. Для повторной загрузки заказа следует удалить его из базы заказов в магазине.</li>
    <li>В закладке "Дополнительно" предпросмотра заказа с WB выводится полная информация по заказу в виде массива данных.</li>
    <li>Для автоматической загрузки заказов по расписанию следует добавить новую задачу в модуль <a href="https://docs.phpshop.ru/moduli/razrabotchikam/cron" target="_blank">Задачи</a> с адресом запускаемого файла <code>phpshop/modules/wbseller/cron/orders.php</code>. Загрузка будет только тех заказов, статус которых был выбран в настройках модуля. </li>
    <li>Поддерживается автоматическое списание товара по признаку статуса заказа в магазине из настроек модуля.</li>
  </ol>
  
 <h4>Загрузка товаров с WB</h4>
   <ol>
    <li>Список товаров для загрузки из WB доступен в разделе "Модули - WB Partners- Товары из WB". По клику на название товара откроется карточка с описанием данных по товару с WB. Для загрузки товара используется кнопка <kbd>Загрузить товар</kbd>. Для повторной загрузки товара следует удалить его из базы товаров в магазине. Из WB загрузятся данные по товару, в том числе изображения и характеристики.</li>
  </ol>
        </p>';
    
    return $PHPShopGUI->setInfo($Info, 280, '98%');
}
?>
